; domain
(define (domain bar-domain)

    (:requirements :strips)
    
    (:predicates 
        (LOCATION ?l)(GLASS ?g)(CUSTOMER ?c)
        (at-glass ?g ?l);glass is on the shelf or the customer
        (at-disp ?l);dispenser is on the stand or hand
        (left_empty ?hl)(right_empty ?hr);free hands
        (hold-glass ?g ?hl);glass is on the left hand
        (hold-disp ?hr);dispenser is on the right hand
        (filled ?g);glass is full
        (served ?g ?c);glass is served to the customer
    )
    
    (:action fetch;take the glass from its shelf
        :parameters (?g ?l ?hl)
        :precondition (and (GLASS ?g)(LOCATION ?l)
                            (at-glass ?g ?l);glass is on the shelf
                            (left_empty ?hl);left hand is free
                            )
        :effect (and (hold-glass ?g ?hl);glass is holded
                        (not (left_empty ?hl));left hand is no more free
                        (not (at-glass ?g ?l));glass is not at the shelf
                )
    )
    
    (:action unhook;take dispenser from its stand
        :parameters (?hr ?l)
        :precondition (and (LOCATION ?l)
                        (right_empty ?hr);right hand is free
                        (at-disp ?l));dispenser at its stand
        :effect (and (hold-disp ?hr);dispenser is on the right hand
                        (not (at-disp ?l));dispenser is not in the stand
                        (not (right_empty ?hr));righ hand is not free
                )
    )
    
     (:action pour;if both glass and dispenser are holded
        :parameters (?g ?hr ?hl)
        :precondition (and (GLASS ?g)
                        (hold-disp ?hr);dispenser is holded
                        (hold-glass ?g ?hl));glass is on the left hand
        :effect (and (filled ?g));glass is filled
    )
    
    (:action serve;serve filled glass to the customer
        :parameters (?c ?g ?hl ?hr)
        :precondition (and (CUSTOMER ?c)(GLASS ?g)
                        (hold-glass ?g ?hl);glass is holded
                        (right_empty ?hr);right hand is free
                        (filled ?g));glass is filled
        :effect (and (served ?g ?c);glass is served to the customer
                    (left_empty ?hl);left hand is free
                    (not (hold-glass ?g ?hl));glass is not on the left hand
        )
    )
    
    (:action hook;put the dispenser to its stand again
        :parameters (?hr ?l)
        :precondition (and (LOCATION ?l)
                        (hold-disp ?hr));dispenser is holded
        :effect (and (at-disp ?l);dispenser is in the stand
                    (right_empty ?hr);right hand is free
                    (not (hold-disp ?hr));dispenser is not holded on the right hand
        )
    )


)

; problem
(define (problem bar-problem)

(:domain bar-domain)


    (:objects
        glass1 glass2 glass3 glass4;glasses
        dispenser
        costumer1 costumer2 costumer3 costumer4;customers
        shelf stand;locations
        hand_left hand_right;two robot hands
    )
    
    (:init
        ;customers 1,2,3,4
        (CUSTOMER costumer1)(CUSTOMER costumer2)(CUSTOMER costumer3)(CUSTOMER costumer4)
        ;glasses 1,2,3,4
        (GLASS glass1)(GLASS glass2)(GLASS glass3)(GLASS glass4)
        ;locations as shelf and stand
        (LOCATION shelf)(LOCATION stand)
        ;glass location
        (at-glass glass1 shelf)(at-glass glass2 shelf)
        (at-glass glass3 shelf)(at-glass glass4 shelf)
        ;dispenser location
        (at-disp stand)
        ;free hands
        (left_empty hand_left)(right_empty hand_right)
    )
    
    (:goal ;all filled glasses are served to the customers
        (and (served glass1 costumer1)(served glass2 costumer2)
            (served glass3 costumer3)(served glass4 costumer4))
    )




)

; plan
1. (unhook hand_right stand)
   deleted: (at-disp stand) (right_empty hand_right)
   added: (hold-disp hand_right)
   goals met: 0 of 4
2. (fetch glass4 shelf hand_left)
   deleted: (left_empty hand_left) (at-glass glass4 shelf)
   added: (hold-glass glass4 hand_left)
   goals met: 0 of 4
3. (pour glass4 hand_right hand_left)
   added: (filled glass4)
   goals met: 0 of 4
4. (hook hand_right shelf)
   deleted: (hold-disp hand_right)
   added: (at-disp shelf) (right_empty hand_right)
   goals met: 0 of 4
5. (serve costumer4 glass4 hand_left hand_right)
   deleted: (hold-glass glass4 hand_left)
   added: (served glass4 costumer4) (left_empty hand_left)
   goals met: 1 of 4
6. (unhook hand_right shelf)
   deleted: (at-disp shelf) (right_empty hand_right)
   added: (hold-disp hand_right)
   goals met: 1 of 4
7. (fetch glass3 shelf hand_left)
   deleted: (left_empty hand_left) (at-glass glass3 shelf)
   added: (hold-glass glass3 hand_left)
   goals met: 1 of 4
8. (pour glass3 hand_right hand_left)
   added: (filled glass3)
   goals met: 1 of 4
9. (hook hand_right shelf)
   deleted: (hold-disp hand_right)
   added: (at-disp shelf) (right_empty hand_right)
   goals met: 1 of 4
10. (serve costumer3 glass3 hand_left hand_right)
   deleted: (hold-glass glass3 hand_left)
   added: (served glass3 costumer3) (left_empty hand_left)
   goals met: 2 of 4
11. (unhook hand_right shelf)
   deleted: (at-disp shelf) (right_empty hand_right)
   added: (hold-disp hand_right)
   goals met: 2 of 4
12. (fetch glass2 shelf hand_left)
   deleted: (left_empty hand_left) (at-glass glass2 shelf)
   added: (hold-glass glass2 hand_left)
   goals met: 2 of 4
13. (pour glass2 hand_right hand_left)
   added: (filled glass2)
   goals met: 2 of 4
14. (hook hand_right shelf)
   deleted: (hold-disp hand_right)
   added: (at-disp shelf) (right_empty hand_right)
   goals met: 2 of 4
15. (serve costumer2 glass2 hand_left hand_right)
   deleted: (hold-glass glass2 hand_left)
   added: (served glass2 costumer2) (left_empty hand_left)
   goals met: 3 of 4
16. (unhook hand_right shelf)
   deleted: (at-disp shelf) (right_empty hand_right)
   added: (hold-disp hand_right)
   goals met: 3 of 4
17. (fetch glass1 shelf hand_left)
   deleted: (left_empty hand_left) (at-glass glass1 shelf)
   added: (hold-glass glass1 hand_left)
   goals met: 3 of 4
18. (pour glass1 hand_right hand_left)
   added: (filled glass1)
   goals met: 3 of 4
19. (hook hand_right shelf)
   deleted: (hold-disp hand_right)
   added: (at-disp shelf) (right_empty hand_right)
   goals met: 3 of 4
20. (serve costumer1 glass1 hand_left hand_right)
   deleted: (hold-glass glass1 hand_left)
   added: (served glass1 costumer1) (left_empty hand_left)
   goals met: 4 of 4
